package de.telran.homeWork.hw_24;

public class HotelDemo {
    /*
 1. Вы въезжаете в отель и подходите к стойке администратора. За стойкой никого нет, но на ней стоит звоночек,
используя который Вы можете позвать администратора. Т.к. наплыв гостей очень редко бывает большим,
чтобы организовывалась очередь, администратор обычно "уходит по своим делам", обслужив Вас и ждет следующего звонка.
Напишите программу, которая автоматизирует данный процесс обслуживания.
Гость и Администратор - отдельные потоки приложения.
Используйте wait / notify механизм многопоточности.
*/
    public static void main(String[] args) {
    }
}
